Task: Build decision tree model to predict survival based on certain parameters

In this file using following columns build a model to predict if person would survive or not,

1.Pclass

2.Sex

3.Age

4.Fare

Calculate score of your model

use titanic_ML9.csv

In [31]:
import pandas as pd
df = pd.read_csv("titanic_ML9.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
# drop unwanted columns
df.drop(["PassengerId", "Name", "SibSp", "Parch", "Ticket", "Cabin", "Embarked"], axis= "columns", inplace= True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

Data cleaning an dchecking for missing values

In [33]:
# check for missing values
df.isnull(). values. any()

True

In [34]:
# see columns with null values
df.isnull().any()

Survived    False
Pclass      False
Sex         False
Age          True
Fare        False
dtype: bool

In [35]:
df.isna().sum()  ## Returns the sum of NaN values in each column.

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [36]:
# df["Age"].sample(20)
# fill NaN values in age
df.Age = df.Age.fillna(df.Age.mean())
df.Age.sample(20)

162    26.000000
287    22.000000
557    29.699118
145    19.000000
634     9.000000
126    29.699118
459    29.699118
60     22.000000
130    33.000000
870    26.000000
424    18.000000
139    24.000000
429    32.000000
238    19.000000
83     28.000000
427    19.000000
335    29.699118
683    14.000000
826    29.699118
11     58.000000
Name: Age, dtype: float64

In [37]:
df.isnull(). values. any()

False

no missing values observed

In [38]:
# convert male and female to one and two
df.Sex = df.Sex.map({'male': 1, 'female': 2})

In [50]:
df.head(20)

    Survived  Pclass  Sex        Age     Fare
0          0       3    1  22.000000   7.2500
1          1       1    2  38.000000  71.2833
2          1       3    2  26.000000   7.9250
3          1       1    2  35.000000  53.1000
4          0       3    1  35.000000   8.0500
5          0       3    1  29.699118   8.4583
6          0       1    1  54.000000  51.8625
7          0       3    1   2.000000  21.0750
8          1       3    2  27.000000  11.1333
9          1       2    2  14.000000  30.0708
10         1       3    2   4.000000  16.7000
11         1       1    2  58.000000  26.5500
12         0       3    1  20.000000   8.0500
13         0       3    1  39.000000  31.2750
14         0       3    2  14.000000   7.8542
15         1       2    2  55.000000  16.0000
16         0       3    1   2.000000  29.1250
17         1       2    1  29.699118  13.0000
18         0       3    2  31.000000  18.0000
19         1       3    2  29.699118   7.2250

In [40]:
# divide into target variable and independent(inputs)

inputs = df.drop("Survived", axis= "columns")
target = df.Survived

In [41]:
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    2  38.0  71.2833
2       3    2  26.0   7.9250
3       1    2  35.0  53.1000
4       3    1  35.0   8.0500

In [51]:
len(inputs)

891

In [42]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [52]:
len(target)

891

In [43]:
from sklearn.model_selection import train_test_split

In [64]:


X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size= 0.2)

In [55]:
len(X_train)

712

In [56]:
len(X_test)

179

In [65]:
# training
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [66]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [67]:
model.score(X_test, y_test)

0.8100558659217877